app/controllers/gists_controller.rb

  def index
       @gists = Gist.paginate(:page => params[:page]).search(params[:search])
---
SELECT "gists".* FROM "gists"

  def create
    @gist = Gist.new(gist_params)

    respond_to do |format|
      if @gist.save
---
INSERT INTO "gists" ("created_at", "description", "lang", "snippet", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @gist.update(gist_params)
---
UPDATE "gists" SET "snippet" = ?, "updated_at" = ? WHERE "gists"."id" = 1  [["snippet", "def hello\r\n  puts \"hello world\"\r\nend"], ["updated_at", Tue, 04 Feb 2014 15:55:22 UTC +00:00]]

    def set_gist
      @gist = Gist.find(params[:id])
---
SELECT "gists".* FROM "gists" WHERE "gists"."id" = ? LIMIT 1  [["id", "1"]]